App/app/controllers/pizzeria_points_controller.rb

SELECT "pizzeria_points".* FROM "pizzeria_points" ORDER BY id asc
---
  def index
    @pizzeria_points = PizzeriaPoint.search(params[:search]).includes(:ingredients_price.name).order(sort_column(PizzeriaPoint.column_names + ["ingredients_prices.name"]) + " " + sort_direction)