App/app/controllers/pizza_types_controller.rb

  def index
    @pizza_types = PizzaType.search(params[:search]).order(sort_column(PizzaType.column_names) + " " + sort_direction)
---
SELECT "pizza_types".* FROM "pizza_types" ORDER BY id asc