app/controllers/pizza_sizes_controller.rb

SELECT "pizza_sizes".* FROM "pizza_sizes" ORDER BY id asc
---
  def index
    @pizza_sizes = PizzaSize.search(params[:search]).order(sort_column(PizzaSize.column_names) + " " + sort_direction)